# vsoWidgetPopupClearN

## Description
For an OIP search popup widget, clears the static or dynamic choices.

```pascal
PROCEDURE vsoWidgetPopupClearN(
				widgetID      : LONGINT;
				staticChoices : BOOLEAN);
```

```python

def vs.vsoWidgetPopupClearN(widgetID, staticChoices):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|widgetID|LONGINT||
|staticChoices|BOOLEAN||

## Version
Availability: from Vectorworks 2020
## Category
* Object Events